var quizQuestions = [

    {
        question: "Должен ли кандидат знать английский язык?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Достаточно знания языка на уровне чтения документации"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n",
                content: "Достаточно умения разговаривать на бытовом уровне + " +
                    "позволяет сотрудничать с англоговорящими коллегами, " +
                    "но рабочее общение на английском языке ограничено хорошо знакомыми темами"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Свободно общаться как с англоговорящими коллегами, так и с представителями заказчика."
            }
        ]
    },
    {
        question: "Должен ли кандидат иметь опыт коммерческой разработки?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Не обязательно, нам достаточно посмотреть несколько проектов на GitHub, ведь в процессе можно доучить человека. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Конечно, опыт разработки в коммерческих проектах нужен. Хотя бы года 2-3 в JS"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Нам необходим опыт коммерческой разработки как минимум 5 лет + " +
                    "кандидат должен уметь управлять командой разработчиков и общаться с заказчиком"
            }
        ]
    },
    {
        question: "Должен ли кандидат уметь пользоваться системами управления контентом (CMS)? ",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Да, конечно. Поставить шаблон, прописать заголовки, метатэги. Немножко подправить верстку. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "WordPress, Joomla, Bitrix, Drupal - нет вообще никаких проблем в использовании CMS"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "CMSки слишком неуклюжие по сравнению с возможностями JS, React, Angular или Vue"
            }
        ]
    },
    {
        question: "Насколько важно, чтобы кандидат знал HTML?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Достаточно знать разницу между тегами селекторов и индетификаторов"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Должен знать: HTML5, CSS, Bootstrap, Flexbox, уметь верстать современные страницы с PSD, Figma и любить Perfect pixel"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Нужен опыт в верстке 7+ лет. Начиная с WAP страничек для кнопочных телефонов и " +
                    "заканчивая кроссбраузерной версткой под все современные браузеры, включая ненавистный IE"
            }
        ]
    },
    {
        question: "Должен ли кандидат знать JavaScript?",
        answers: [
            {
              type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                  "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                  "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                  "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                  "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                  "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                  "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                  "\n" +
                  "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                  "\n" +
                  "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
              content: "Иметь базовое представление о JS - в чём разница между null и undefined, что такое string и number. Всему остальному мы научим в процессе."
            },
            {
              type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                  "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                  "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                  "\n" +
                  "\n" +
                  "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                  "\n" +
                  "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                  "\n" +
                  "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
              content: "Понимает базовые концепции, хорошо знает JavaScript. Кандидат легко своими словами расскажет, " +
                      "как работает браузер, какие в нём инструменты и как ими пользоваться, как работает асинхронность и другие вещи из языка. " +
                      "Также кандидат может объяснять абстрактные вещи типа замыкания и контекстов, а также без труда видит возможные варианты решения задач, " +
                      "или знает где их взять и как применить"
            },
            {
              type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                  "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                  "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                  "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                  "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                  "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                  "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                  "\n" +
                  "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
              content: "Понимание всего JS целиком и полностью. Всех его багов и фич. " +
                  "Знание ES6, ES2015, ES7, etc. " +
                  "Понимание взаимодействия браузера с клиентом, отличные познания в HTTP, WS. " +
                  "Понимание асинхронности, синхронности, синхронизации. " +
                  "Ументь разбираться в ООП и ФП паттернах. "
            }
        ]
    },
    {
        question: "Должен ли кандидат знать Git?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Кандидат должен отвечать на следующие вопросы: \n" +
                    "Какие системы контроля версий вы знаете? \n" +
                    "Чем отличаются SVN и Git? \n" +
                    "Что такое GitHub? \n" +
                    "У вас есть свои проекты на GitHub? \n" +
                    "Зачем нужны системы контроля версий? \n" +
                    "Как создать Git-репозиторий? \n" +
                    "В чем разница между GitHub и Git? \n" +
                    "За что отвечает команда “git config”? \n" +
                    "Отличия между «git pull» и «git fetch»? \n"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Кандидат разбирается в следующих темах: \n" +
                    "Что такое git-rebase и для чего он нужен? \n" +
                    "Как именно исправить проблему, если она возникает в Git? \n" +
                    "Если в данный момент посвящение нажато и открыто, как вернуть его обратно в Git? \n" +
                    "В чем разница между командой git pull и командой git give? \n" +
                    "Что такое «индекс» или «место размещения» в Git? \n"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Кандидат разбирается в следующих темах: \n" +
                    "Как восстановить удалённый файл? \n" +
                    "Как отменить все изменения, кроме тех, что уже добавлены в планируемый коммит? \n" +
                    "Как добавить пустую папку в репозиторий? \n" +
                    "Как переименовать локальную ветку? \n" +
                    "Каковы преимущества использования системы вариационного контроля? \n" +
                    "Как объединить несколько отдельных коммитов в один цельный коммит? \n"
            }
        ]
    },
    {
        question: "Должен ли кандидат знать React?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Должен уметь читать документацию. Знать, для чего вообще нужен React. Что такое JSX, должен знать, " +
                    "какие основные преимущества есть в React, рассказать про Virtual DOM, Props, state и refs. " +
                    "Должен знать, когда следует использовать Class компоненты, а когда функциональные. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Как React обрабатывает пользовательские события, что такое Redux, что такое store в Redux, что такое action в Redux. " +
                    "Знать основные этапы жизненного цикла компонента. " +
                    "Знать разницу между Презентационным и Контейнер компонентом. Знать что такое Higher-Order компоненты. " +
                    "Что делает shouldComponentUpdate и почему он важен? Почему не стоит изменять state напрямую. "
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Знает разницу между Flux и MVC. Понимает, что такое mapStateToProps и mapDispatchToProps. " +
                    "Знает, как можно улучшить производительность React приложения. Знает, зачем нужен Redux Thunk. " +
                    "Знает разницу между Flow и PropTypes и знает, такое React Fiber. Понимает, зачем делать eject и что такое reducer. "
            }
        ]
    },
    {
        question: "Должен ли кандидат знать Angular?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Кандидат должен отвечать на следующие вопросы: \n" +
                    "Что такое Angular CLI? \n" +
                    "Как установить Angular CLI, как создать новый проект, используя Angular CLI. \n" +
                    "Что такое декораторы? \n" +
                    "Какие есть способы привязки данных в Angular? \n" +
                    "Каков жизненный цикл компонента в Angular? \n" +
                    "Что такое интерполяция в Angular? \n" +
                    "Понимать разницу между структурной и атрибутной директивой, назвать встроенные директивы. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Кандидат знает следующие темы: " +
                    "Что такое Реактивное программирования в Angular? \n" +
                    "Что такое Protractor? \n" +
                    "Какие функции несет в себе RxJS? \n" +
                    "Какие есть стратегии загрузки модулей? \n" +
                    "Зачем нужен zone.js? \n" +
                    "Что делает Just-In-Time Compiler? \n" +
                    "Что такое Incremental DOM и отличие от Virtual DOM? \n" +
                    "Знать и понимать разницу между Pure Pipe и Impure Pipe. \n" +
                    "Какая разница между BehaviorSubject и Observable. "
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Кандидат должен понимать и дать ответы на следующие вопросы: \n" +
                    "Рассказать об основных параметрах @NgModule, @Component, @Directive, @Injectable, @Pipe. \n" +
                    "В чем разница между Routing и Navigation? \n" +
                    "Как применить анимацию к компонентам? \n" +
                    "Что такое EventEmmiter и как подписываться на события? \n" +
                    "Как применять валидацию для форм? \n" +
                    "Что такое реактивные формы в Angular? \n" +
                    "Что такое Shadow DOM и как с ним работать в Angular? \n"
            }
        ]
    },
    {
        question: "Должен ли кандидат знать Vue?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Кандидат должен отвечать на следующие вопросы: \n" +
                    "На каком шаблоне проектирования основан Vue? \n" +
                    "Как подключить внешний css файл в Vue? \n" +
                    "Основные особенности Vue.js \n" +
                    "Как подключить jQuery плагин? \n" +
                    "Что такое реквизит? \n" +
                    "В чем разница между v-if и v-show? \n" +
                    "Что такое Vue CLI \n" +
                    "Что такое компонент \n" +
                    "Жизненный цикл каждого экземпляра Vue \n"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Кандидат разбирается в следующих темах: \n" +
                    "Что такое вычисляемые свойства и когда их нужно использовать? \n" +
                    "Что такое Vuex \n" +
                    "Что такое миксины Vue.js \n" +
                    "Как сделать условный рендеринг компонента? \n" +
                    "Ести ли в Vue.js поддержка data binding? Если да, как его использовать? \n" +
                    "Как реализовать маршрутизацию на стороне клиента  в Vue? \n" +
                    "Как програмно сделать редирект в Vue Router? \n"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Кандидат разбирается в следующих темах: \n" +
                    "Как защитить какой-то маршрут от несанкционированного доступа? \n" +
                    "Как на Vue.js вставить значение атрибута? \n" +
                    "Как добавлять и изменять классы на vue.js. \n" +
                    "Как получить значение checkbox на vue.js. \n" +
                    "Как добавить заготовленный html на vue.js. \n" +
                    "Как использовать циклы на vue.js. \n" +
                    "Как использовать условия на vue.js. \n" +
                    "Как отключить кнопку (disabled) на vue.js. \n"
            }
        ]
    },
    {
        question: "Должен ли кандидат знать TypeScript?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Кандидат должен отвечать на следующие вопросы: \n" +
                    "Что такое TypeScript и зачем использовать его вместо JavaScript? \n" +
                    "Рассказать об обобщённых типах в TypeScript. \n" +
                    "Поддерживает ли TypeScript все принципы объектно-ориентированного программирования? \n" +
                    "Как в TypeScript проверять значения на равенство null и undefined? \n" +
                    "Что такое внешние объявления переменных в TypeScript и когда их нужно использовать?"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Кандидат разбирается в следующих темах: \n" +
                    "Как в TypeScript реализовать свойства класса, являющиеся константами? \n" +
                    "Что представляют собой .map-файлы в TypeScript? \n" +
                    "Что такое геттеры и сеттеры в TypeScript? \n" +
                    "Можно ли использовать TypeScript в серверной разработке, и если да — то как? \n" +
                    "Рассказать об основных компонентах TypeScript. \n" +
                    "Чем различаются ключевые слова interface и type в TypeScript? \n" +
                    "Можно ли автоматически генерировать файлы объявлений TypeScript из JS-библиотек? \n"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Кандидат хорошо разбирается в следующих темах: \n" +
                    "Рассказать об использовании декораторов свойств в TypeScript. \n" +
                    "Можно ли в TypeScript использовать строго типизированные функции в качестве параметров? \n" +
                    "Как сделать так, чтобы классы, объявленные в модуле, были бы доступны и за пределами этого модуля? \n" +
                    "Поддерживает ли TypeScript перегрузку функций? \n" +
                    "Как в TypeScript перегрузить конструктор класса? \n" +
                    "Рассказать о том, когда в TypeScript используют ключевое слово declare. "
            }
        ]
    },
    {
        question: "Должен ли кандидат уметь получать данные с сервера?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "В принципе, это не обязательно - в проекте не предусмотрено получение данных с сервера. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Кандидат должен уметь, как получать в Javascript данные от сервера с помощью HTTP запросов. " +
                    "А заклинания XMLHttpRequest, Fetch API не должны испугать кандидата. "
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Помимо XMLHttpRequest и Fetch API еще может использовать Axios в React и Vue или HttpClient в Angular"
            }
        ]
    },
    {
        question: "Должен ли кандидат уметь пользоваться таск-трекерами",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Не обязательно - у нас собственная канбан-доска и мы всему обучим. "
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Конечно нужен опыт - в Trello или Jira."
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Кандидат должен не только ументь передвигать задачи по доске, но и декомпозировать текущую задачу на более мелкие. " +
                    "Планировать спринты и распределять задания в своей команде разработчиков."
            }
        ]
    },
    {
        question: "Должен ли уметь кандидат писать unit-тесты? ",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Кандидат должен понимать основы автоматического тестирования, " +
                    "которые входят в «образовательный минимум» программиста."
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Умеет использовать соответствующие JavaScript-библиотеки - Mocha, Chai"
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Знаком с техникой под названием BDD, использует JavaScript-библиотеки - Mocha, Chai и Sinon"
            }
        ]
    },
    {
        question: "Должен ли кандидат иметь опыт работы Team Leader?",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Нам нужен Junior и ему еще много чему нужно будет научиться, прежде, чем стать TL"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "Да, нам нужен не только программист, но и сотрудник, который проявляет много инициативы, " +
                    "усердно работает, ответственный, показывает, что у него есть лидерские качества и т.д."
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Вот именно, нам нужен человек с лидерскими качествами, " +
                    "который сможет мотивировать команду разработчиков выполнять работу точно, в срок и не допускать дедлайнов."
            }
        ]
    },
    {
        question: "Должен ли кандидат знать и применять в работе методологии разработки",
        answers: [
            {
                type: "Итак, вам подходит лучше всего Junior frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на уровне чтения документации, опыта коммерческой разработки практически нет - в наличии только небольшие проекты на GitHub.  \n" +
                    "В то же время, ваш кандидат умеет опыт в работе с  популярными CMS, имеет базовые знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат знает базовые вещи о системах контроля версий, понимает разницу между SVN и Git, знает как создать Git-репозиторий и умеет работать с командной строкой. \n" +
                    "В React, Angular или Vue ваш кандидат знает только основы, но самое главное преимущество вашего кандидата - это умение читать документацию и работать с ней. \n" +
                    "С TypeScript ваш кандидат работал совсем немного и знает в основном теорию. Работа с получением различных данных для вашего кандидата будет вновинку.  \n" +
                    "Ваш кандидат еще не умеет работать с таск-трекерами, но в скором времени обязательно научится. А еще он слышал про методологии разработки Agile, Waterfall. \n" +
                    "\n" +
                    "Эти ребята являются отличным материалом для получения уверенного в себе Middle frontend developer и, в дальнейшем, Senior. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/xmoBOgt",
                content: "Достаточно знать в теории про Agile, Waterfall"
            },
            {
                type: "Итак, вам подходит лучше всего Middle frontend developer. \n" +
                    "Вы ищите кандидата, который владеет английским языком на бытовом уровне и может поддерживать разговор в рамках проекта с коллегами из других стран. У вашего кандидата приличный опыт коммерческой разработки, уверенные знания HTML, CSS, JS и TypeScript. Ваш кандидат знает, как работать с Git, умеет создавать репозитории, создавать новые ветки, делать пуллреквесты и многое другое. Ваш кандидат применяет в работе различные методологии разработки - Agile, Waterfall и другие, в зависимости от проекта.\n" +
                    "Ваш кандидат умеет в React, Angular или Vue и имеет опыт разработки на одном из фреймворков от 2-х лет. В работе часто использует получение данных из различных источников с помощью XMLHttpRequest, Fetch API, Axios и HttpClient. Также ваш кандидат работает с помощью таск-текеров Trello или Jira. В процессе работы зачастую пишет Unit-тесты. А еще, ваш кандидат имеет лидерские качества - инициативен, ответственнен и имеет опыт управления командой разработчиков, также он умеет мотивировать разработчиков на своевременное выполнение проекта. И демотивировать тоже))\n" +
                    "\n" +
                    "\n" +
                    "Эти ребята являются отличными рабочими единицами, они много знают и умеют и в скором времени могут стать Senior software developer или TeamLead, если захотят. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/hmo9UTe\n" +
                    "\n" +
                    "Или посмотреть вот эту, наиболее подходящую: https://cutt.ly/5mpfVs0",
                content: "В зависимости от проекта, применять наиболее оптимальные методологии - Agile, Waterfall, "
            },
            {
                type: "Итак, вам подходит лучше всего Senior Frontend developer. \n" +
                    "Вы ищите кандидата, который уверенно владеет английским языком, с большим опытом коммерческой разработки.  \n" +
                    "Ваш кандидат умеет большой опыт в работе с популярными фрейворками, имеет глубокие знания в HTML, CSS, JS.  \n" +
                    "Ваш кандидат свободно работает в различных системах контроля версий, командная строка для него как родная. \n" +
                    "В React, Angular или Vue ваш кандидат спокойно может написать не только интерент-магазин, но и новый Facebook =)) \n" +
                    "С TypeScript ваш кандидат работал много, знает и понимает множество нюансов.  \n" +
                    "Ваш кандидат любит работать на сложных и интересных проектах - его трудно заинтересовать только деньгами. \n" +
                    "\n" +
                    "Посмотреть вакансии: https://cutt.ly/wmjz0aL",
                content: "Знает 7 методологий разработки: Agile, Waterfall, " +
                    "знает про V-Model и в каких проектах ее используют. " +
                    "Знаком с Incremental Model, RAD Model, Iterative Model и Spiral Model"
            }
        ]
    }
];

export default quizQuestions;
